# Реализовать два небольших скрипта:
# а) итератор, генерирующий целые числа, начиная с указанного,
# б) итератор, повторяющий элементы некоторого списка, определенного заранее.
# Подсказка: использовать функцию count() и cycle() модуля itertools. Обратите внимание,
# что создаваемый цикл не должен быть бесконечным. Необходимо предусмотреть условие его завершения.
# Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
# Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.

import itertools

start = 3
end = 10

iterator = itertools.count(start)

result_a = [next(iterator) for _ in range(end - start)]
iterator = itertools.cycle(result_a)
result_b = [next(iterator) for _ in range(len(result_a))]
print(result_a)
print(result_b)